burgrp/py32-svd/svd/py32md410xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32MD410xx</name>
  <series>PY32M</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ADC interrupt and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EOSMP</name>
              <description>ADC group regular end of sampling flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOC</name>
              <description>ADC group regular end of unitary conversion flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQ</name>
              <description>ADC group regular end of sequence conversions flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>ADC group regular overrun flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWD</name>
              <description>ADC analog watchdog flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>EOSMPIE</name>
              <description>ADC group regular end of sampling interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOCIE</name>
              <description>ADC group regular end of unitary conversion interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQIE</name>
              <description>ADC group regular end of sequence conversions interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVRIE</name>
              <description>ADC group regular overrun interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWDIE</name>
              <description>ADC analog watchdog interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADEN</name>
              <description>ADC enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDIS</name>
              <description>ADC disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADSTART</name>
              <description>ADC group regular conversion start</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MSBSEL</name>
              <description>ADC resolution highest bit conversion time control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADSTP</name>
              <description>ADC group regular conversion stop</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VREFBUF_EN</name>
              <description>ADC VrefBuffer enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VREFBUF_SEL</name>
              <description>ADC VrefBuffer output voltage select</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>ADCAL</name>
              <description>ADC group regular conversion calibration</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>ADC configuration register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>ADC DMA transfer enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMACFG</name>
              <description>ADC DMA transfer configuration</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SCANDIR</name>
              <description>Scan sequence direction</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RESSEL</name>
              <description>ADC data resolution</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>ALIGN</name>
              <description>ADC data alignement</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>ADC group regular external trigger source</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>EXTEN</name>
              <description>ADC group regular external trigger polarity</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OVRMOD</name>
              <description>ADC group regular overrun configuration</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <description>ADC group regular continuous conversion mode</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAIT</name>
              <description>Wait conversion mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DISCEN</name>
              <description>ADC group regular sequencer discontinuous mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>ADC analog watchdog monitoring a single channel or all channels</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AWDEN</name>
              <description>ADC analog watchdog enable on scope ADC group regular</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AWDCH</name>
              <description>ADC analog watchdog monitored channel selection</description>
              <bitRange>[29:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>ADC configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>ADC clock mode</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR0</name>
          <displayName>SMPR0</displayName>
          <description>ADC sampling time register 0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SMP0</name>
              <description>Sampling time selection</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SMP1</name>
              <description>Sampling time selection</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SMP2</name>
              <description>Sampling time selection</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>SMP3</name>
              <description>Sampling time selection</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>SMP4</name>
              <description>Sampling time selection</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SMP5</name>
              <description>Sampling time selection</description>
              <bitRange>[17:15]</bitRange>
            </field>
            <field>
              <name>SMP6</name>
              <description>Sampling time selection</description>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SMP7</name>
              <description>Sampling time selection</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>SMP8</name>
              <description>Sampling time selection</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>SMP9</name>
              <description>Sampling time selection</description>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <displayName>SMPR1</displayName>
          <description>ADC sampling time register 1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SMP10</name>
              <description>Sampling time selection</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SMP11</name>
              <description>Sampling time selection</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SMP12</name>
              <description>Sampling time selection</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>SMP13</name>
              <description>Sampling time selection</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>SMP14</name>
              <description>Sampling time selection</description>
              <bitRange>[14:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <displayName>TR</displayName>
          <description>ADC analog watchdog 1 threshold register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0xFFF0000</resetValue>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC analog watchdog threshold low</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <description>ADC analog watchdog threshold high</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR</name>
          <displayName>CHSELR</displayName>
          <description>ADC group regular sequencer register</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0xFFF0000</resetValue>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>Channel-0 selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>Channel-1 selection</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>Channel-2 selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>Channel-3 selection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>Channel-4 selection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>Channel-5 selection</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>Channel-6 selection</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Channel-7 selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>Channel-8 selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>Channel-9 selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHSEL10</name>
              <description>Channel-10 selection</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CHSEL11</name>
              <description>Channel-11 selection</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHSEL12</name>
              <description>Channel-12 selection</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CHSEL13</name>
              <description>Channel-13 selection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHSEL14</name>
              <description>Channel-14 selection</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQR0</name>
          <displayName>SEQR0</displayName>
          <description>ADC sequence select register 0</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>SQ0</name>
              <description>ADC sequence select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ1</name>
              <description>ADC sequence select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC sequence select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC sequence select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC sequence select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC sequence select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC sequence select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC sequence select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQR1</name>
          <displayName>SEQR1</displayName>
          <description>ADC sequence select register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>SQ8</name>
              <description>ADC sequence select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ9</name>
              <description>ADC sequence select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>SQ10</name>
              <description>ADC sequence select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SQ11</name>
              <description>ADC sequence select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SQ12</name>
              <description>ADC sequence select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>SQ13</name>
              <description>ADC sequence select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>SQ14</name>
              <description>ADC sequence select</description>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <displayName>CCSR</displayName>
          <description>ADC calibration configuration and status register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>Calibration contents selection</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CALSMP</name>
              <description>Calibration sample time selection</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>CALSET</name>
              <description>Calibration factor selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OFFSUC</name>
              <description>Offset calibration status flag</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CAPSUC</name>
              <description>Cap calibration status flag</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR1</name>
          <displayName>CALRR1</displayName>
          <description>ADC calibration result register 1</description>
          <addressOffset>0x48</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CALC4OUT</name>
              <description>C4 result</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC5OUT</name>
              <description>C5 result</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALBOUT</name>
              <description>offset result</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR2</name>
          <displayName>CALRR2</displayName>
          <description>ADC calibration result register 2</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CALC0OUT</name>
              <description>C0 result</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC1OUT</name>
              <description>C1 result</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALC2OUT</name>
              <description>C2 result</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>CALC3OUT</name>
              <description>C3 result</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
