burgrp/py32-svd/svd/py32md410xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2</name>
        <description>I2C2 global Interrupt</description>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>Independent watchdog</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>Key register (IWDG_KR)</description>
          <addressOffset>0x0</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Prescaler register (IWDG_PR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler divider</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>Reload register (IWDG_RLR)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0xFFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reload value</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register (IWDG_SR)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>LCD CONTROLLER</description>
      <groupName>LCD</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <description>LCD global Interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CR0</name>
          <displayName>CR0</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCDCLK</name>
              <description>LCDCLK</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BIAS</name>
              <description>BIAS</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>DUTY</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>BSEL</name>
              <description>BSEL</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>CONTRAST</name>
              <description>CONTRAST</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>BLINKCNT</name>
              <description>BLINKCNT</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>BLINKEN</name>
              <description>BLINKEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INTF</name>
              <description>INTF</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <displayName>INTCLR</displayName>
          <description>INTCLR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>INTF_CLR</name>
              <description>INTF_CLR</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN0</name>
          <displayName>POEN0</displayName>
          <description>POEN0</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>S4</name>
              <description>S4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S5</name>
              <description>S5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S6</name>
              <description>S6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S7</name>
              <description>S7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>S8</name>
              <description>S8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>S9</name>
              <description>S9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>S10</name>
              <description>S10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>S11</name>
              <description>S11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>S12</name>
              <description>S12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>S13</name>
              <description>S13</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN1</name>
          <displayName>POEN1</displayName>
          <description>POEN1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>S17</name>
              <description>S17</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S16</name>
              <description>S16</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S15</name>
              <description>S15</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S14</name>
              <description>S14</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C0</name>
              <description>C0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>C1</name>
              <description>C1</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>C2</name>
              <description>C2</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>C3</name>
              <description>C3</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM0</name>
          <displayName>RAM0</displayName>
          <description>des RAM0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1</name>
          <displayName>RAM1</displayName>
          <description>des RAM1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2</name>
          <displayName>RAM2</displayName>
          <description>des RAM2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM3</name>
          <displayName>RAM3</displayName>
          <description>des RAM3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM4</name>
          <displayName>RAM4</displayName>
          <description>des RAM4</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
