burgrp/py32-svd/svd/py32md410xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPTIM</name>
      <description>Low power timer</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x40007C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPTIM</name>
        <description>LPTIM global Interrupt</description>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ARRM</name>
              <description>Autoreload match</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ARROK</name>
              <description>Autoreload OK</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ARRMCF</name>
              <description>Autoreload match Clear Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ARROKCF</name>
              <description>Autoreload OK Clear Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ARRMIE</name>
              <description>Autoreload match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ARROKIE</name>
              <description>Autoreload OK Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Clock prescaler</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>Registers update mode</description>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control Register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>LPTIM Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SNGSTRT</name>
              <description>LPTIM start in single mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNTSTRT</name>
              <description>LPTIM start in continue mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>COUNTRST</name>
              <description>LPTIM counter reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RSTARE</name>
              <description>Reset after read enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>Autoreload Register</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <description>Auto reload value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>Counter Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA</name>
      <description>Operational amplifier</description>
      <groupName>OPA</groupName>
      <baseAddress>0x40010300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OENR</name>
          <displayName>OENR</displayName>
          <description>OPA output enable register</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>OPA1OEN</name>
              <description>OPA1 output enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OPA2OEN</name>
              <description>OPA2 output enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>OPA control register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>OPA1EN</name>
              <description>OPA1 enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OPA2EN</name>
              <description>OPA2 enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
