burgrp/py32-svd/svd/py32md410xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global Interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CPHA</name>
              <description>Clock phase</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR</name>
              <description>Baud rate control</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SPE</name>
              <description>SPI enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>Frame format</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI</name>
              <description>Internal slave selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSM</name>
              <description>Software slave management</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXONLY</name>
              <description>Receive only</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DFF</name>
              <description>Data frame format</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CRCNEXT</name>
              <description>Transmit CRC next</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <description>Hardware CRC calculation enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BIDIOE</name>
              <description>Output enable in bidirectional mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BIDIMODE</name>
              <description>Bidirectional data mode enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RXDMAEN</name>
              <description>Rx buffer DMA enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>Tx buffer DMA enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSOE</name>
              <description>SS output enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRTXFIFO</name>
              <description>Clear TXFIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RX buffer not empty interrupt enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>Tx buffer empty interrupt enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>status register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RXNE</name>
              <description>Receive buffer not empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmit buffer empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHSIDE</name>
              <description>Channel control</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UDR</name>
              <description>Underflow flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>CRC error flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode fault</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRLVL</name>
              <description>FIFO reception level</description>
              <bitRange>[10:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FTLVL</name>
              <description>FIFO transmission level</description>
              <bitRange>[12:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>data register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>Data register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPR</name>
          <displayName>CRCPR</displayName>
          <description>CRC polynomial register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <displayName>RXCRC</displayName>
          <description>RX CRC register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>RX CRC register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRC</name>
          <displayName>TXCRC</displayName>
          <description>TX CRC register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>TXCRC</name>
              <description>TX CRC register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCFGR</name>
          <displayName>I2SCFGR</displayName>
          <description>I2S Configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CHLEN</name>
              <description>Channel length</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Data length to be transferred</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Steady state clock polarity</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2SSTD</name>
              <description>I2S standard selection</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PCMSYNC</name>
              <description>PCM frame synchronization</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2SCFG</name>
              <description>I2S configuration mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2SE</name>
              <description>I2S enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2SMOD</name>
              <description>I2S mode selection</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SPR</name>
          <displayName>I2SPR</displayName>
          <description>I2S prescaler register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>I2SDIV</name>
              <description>I2S linear prescaler</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ODD</name>
              <description>Odd factor for the prescaler</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MCKOE</name>
              <description>Master clock output enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
